[
  {
    "judul": "Cara Mendaftar di GitLab",
    "langkah": [
      "Buka situs GitLab di https://gitlab.com/",
      "Klik tombol \"Sign In / Register\" di bagian kanan atas halaman.",
      "Lalu pilih opsi \"Register now\" di bawah kotak masuk.",
      "Masukkan informasi yang diperlukan, seperti username, alamat email, dan password.",
      "Verifikasi akun Anda melalui email yang dikirimkan oleh GitLab."
    ],
    "deskripsi": "",
    "gambar": "img/register.svg"
  },
  {
    "judul": "Cara Login di Gitlab",
    "langkah": [
      "Buka situs GitLab di https://gitlab.com/",
      "Klik tombol \"Sign In / Register\" di bagian kanan atas halaman.",
      "Masukkan username atau alamat email, dan password yang telah dibuat saat mendaftar.",
      "Klik tombol \"Sign In\" untuk masuk ke akun Anda."
    ],
    "deskripsi": "",
    "gambar": "img/login.svg"
  },
  {
    "judul": "Cara Membuat Repository",
    "langkah": [
      "Login ke akun GitLab Anda.",
      "Klik tombol \"+\" di bagian atas kanan halaman.",
      "Pilih opsi \"New project\" dari menu drop-down setelah itu pilih “Create blank project”.",
      "Berikan nama dan deskripsi untuk repo Anda.",
      "Pilih jenis aksesibilitas repo, apakah public atau private.",
      "Setelah selesai klik tombol \"Create project\" untuk membuat repo baru."
    ],
    "deskripsi": "",
    "gambar": "img/create-repo.svg"
  },
  {
    "judul": "Cara Rebase",
    "langkah": [
      "Checkout branch yang ingin Anda rebase.",
      "Jalankan perintah <b>‘git fetch’</b> untuk mengambil update dari branch utama.",
      "Jalankan perintah <b>‘git rebase origin/master’</b> untuk melakukan rebase dengan branch master.",
      "Resolusi konflik jika ada, lalu jalankan perintah <b>‘git rebase --continue’</b>.",
      "Setelah selesai, push branch Anda ke repo dengan perintah <b>‘git push -f’</b>."
    ],
    "deskripsi": "Rebase adalah proses memperbarui branch Anda dengan branch utama dan menempatkan perubahan Anda di atasnya.",
    "gambar": "img/rebase.svg"
  },
  {
    "judul": "Cara Commit",
    "langkah": [
      "Buka terminal atau command prompt.",
      "Masuk ke direktori repo Anda.",
      "Jalankan perintah <b>‘git add [nama-file]’</b> untuk menambahkan file ke staging area.",
      "Jalankan perintah <b>‘git commit -m \"pesan commit\"’</b> untuk melakukan commit dengan pesan yang sesuai.",
      "Push commit Anda ke repo dengan perintah git push."
    ],
    "deskripsi": "Commit adalah proses menyimpan perubahan yang dilakukan pada sebuah file atau beberapa file di repo.",
    "gambar": "img/commit.svg"
  },
  {
    "judul": "Cara Push",
    "langkah": [
      "Buka terminal atau command prompt.",
      "Masuk ke direktori repo Anda.",
      "Jalankan perintah <b>‘git add [nama-file]’</b> untuk menambahkan file ke staging area.",
      "Jalankan perintah <b>‘git commit -m \"pesan commit\"’</b> untuk melakukan commit dengan pesan yang sesuai.",
      "Jalankan perintah <b>‘git push’</b> untuk mengirim perubahan ke repo di GitLab."
    ],
    "deskripsi": "Push adalah proses mengirim perubahan yang telah Anda lakukan ke repo di GitLab.",
    "gambar": "img/push.svg"
  },
  {
    "judul": "Cara Pull",
    "langkah": [
      "Buka terminal atau command prompt.",
      "Masuk ke direktori repo Anda.",
      "Jalankan perintah <b>‘git pull’</b> untuk mengambil perubahan dari repo di GitLab dan menggabungkannya.",
      "Jika ada konflik, resolusi konflik tersebut terlebih dahulu sebelum melanjutkan.",
      "Setelah selesai, jalankan perintah <b>‘git push’</b> untuk mengirim perubahan Anda ke repo di GitLab."
    ],
    "deskripsi": "Pull adalah proses mengambil perubahan dari repo di GitLab dan menggabungkannya dengan repo lokal Anda.",
    "gambar": "img/pull.svg"
  },
  {
    "judul": "Cara Branching Project",
    "langkah": [
      "Buka repo di GitLab.",
      "Klik tombol \"New branch\" di bagian atas halaman.",
      "Berikan nama untuk branch baru Anda.",
      "Pilih branch yang ingin Anda jadikan dasar branch baru Anda.",
      "Klik tombol \"Create branch\" untuk membuat branch baru."
    ],
    "deskripsi": "Branching adalah proses membuat salinan dari repo Anda untuk melakukan perubahan atau eksperimen tanpa mempengaruhi branch utama.",
    "gambar": "img/branching.svg"
  },
  {
    "judul": "Cara Merging Project",
    "langkah": [
      "Checkout ke branch utama (biasanya master).",
      "Klik tombol \"Merge request\" di bagian atas halaman repo.",
      "Pilih branch mana yang ingin Anda gabungkan ke branch utama.",
      "Berikan deskripsi untuk merge request Anda.",
      "Klik tombol \"Submit merge request\".",
      "Jika tidak ada konflik, klik tombol \"Merge\" untuk menggabungkan branch dengan branch utama."
    ],
    "deskripsi": "Merging adalah proses menggabungkan perubahan yang dilakukan pada branch lain dengan branch utama.",
    "gambar": "img/merging.svg"
  },
  {
    "judul": "Cara Resolve Conflict",
    "langkah": [
      "Jalankan perintah <b>‘git pull’</b> untuk mengambil perubahan terbaru dari repo di GitLab.",
      "Git akan memberi tahu Anda file mana yang mengalami conflict. Buka file tersebut di editor teks Anda.",
      "Perbaiki konflik secara manual dengan menghapus bagian yang tidak perlu dan menambahkan bagian yang hilang.",
      "Setelah selesai, jalankan peri</b>ntah <b>‘git add [nama-file]’</b> untuk menambahkan file yang sudah diperbaiki ke staging area.",
      "Jalankan perintah <b>‘git commit -m \"pesan commit\"’</b> untuk melakukan commit dengan pesan yang sesuai.",
      "Push commit Anda ke repo dengan perintah git push."
    ],
    "deskripsi": "Conflict terjadi saat ada perubahan yang dilakukan pada satu file oleh dua atau lebih orang secara bersamaan, atau ada perubahan yang dilakukan pada branch yang sama oleh dua atau lebih orang.",
    "gambar": "img/resolve.svg"
  },
  {
    "judul": "Cara Membuat Merge Request",
    "langkah": [
      "Buka repositori yang ingin Anda buat merge request di GitLab.",
      "Pada halaman repositori, klik tab \"Merge Requests\".",
      "Klik tombol \"New merge request\".",
      "Pilih branch sumber (branch yang akan digabungkan) dan branch target (branch yang akan menerima perubahan).",
      "Isi informasi merge request seperti judul dan deskripsi.",
      "Klik \"Submit merge request\" untuk membuat merge request."
    ],
    "deskripsi": "Merge Request adalah fitur di GitLab yang memungkinkan Anda mengajukan perubahan kode dari satu branch ke branch lainnya.",
    "gambar": "img/merge-request.svg"
  },
  {
    "judul": "Cara Mengelola Issues",
    "langkah": [
      "Buka repositori yang ingin Anda kelola isu-isunya di GitLab.",
      "Pada halaman repositori, klik tab \"Issues\".",
      "Klik tombol \"New issue\" untuk membuat isu baru.",
      "Isi informasi isu seperti judul, deskripsi, dan label yang relevan.",
      "Jika diperlukan, tambahkan assignee (orang yang bertanggung jawab) atau assignee tim.",
      "Klik \"Submit issue\" untuk membuat isu."
    ],
    "deskripsi": "Issues dalam GitLab adalah fitur untuk melacak, mengelola, dan berdiskusi tentang tugas, masalah, atau permintaan yang perlu diselesaikan dalam sebuah proyek.",
    "gambar": "img/issue.svg"
  }
]
